import { Back } from "../../index";
import "./rulesPage.css";

export const RulesPage = () => {
  return (
    <div className="rules">
      <Back />
      <h1 className="rules__title">Rules</h1>
      <ul className="rules__list">
        <li>Учасники діляться на пари.</li>
        <li>Кожен гравець отримує по 10 кульок (шариків).</li>
        <li>
          Гравці по черзі вибирають, скільки кульок покласти в руку — від 1 до
          10.
        </li>
        <li>Гравець, який загадує, каже «парне» або «непарне».</li>
        <li>
          Потім обидва гравці одночасно показують свою руку з певною кількістю
          кульок.
        </li>
        <li>
          Якщо сума кульок обох гравців відповідає вгаданому (парна чи непарна),
          то гравець, який вгадав, забирає у суперника кількість кульок скільки він поставив.
        </li>
        <li>
          Якщо ж ні — програє той, хто вгадав неправильно, і віддає кульки.
        </li>
        <li>
          Гра продовжується, доки один з гравців не збере всі кульки або не
          залишиться без них.
        </li>
        <li>Переможець — той, хто збере всі кульки.</li>
      </ul>
    </div>
  );
};
